BusinessProcesses/УдалитьПользователяИнформационнойБазыАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<BusinessProcess>
		<Properties>
			<Name>УдалитьПользователяИнформационнойБазыАИТП</Name>
			<Task>Task.ЗадачаАИТП</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/ВидыЗадачАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыЗадачАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаОшибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыВыполненияЗадачАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СпособыВыполненияЗадачАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интерактивно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыВыполненияДействияАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>РезультатыВыполненияДействияАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Положительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отрицательный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДальнейшиеДействияАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ДальнейшиеДействияАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продолжить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Повторить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/УдалитьПользователяИнформационнойБазыАИТП/Ext/ObjectModule.bsl
Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПередСтартомБП(ТочкаМаршрутаБизнесПроцесса, ЭтотОбъект);
	
КонецПроцедуры

Процедура УдалитьПользователяИнформационнойБазыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриСозданииЗадачи(ТочкаМаршрутаБизнесПроцесса
		, ФормируемыеЗадачи[0]
		, Перечисления.ВидыЗадачАИТП.Действие
		, "УдалитьПользователейИнформационнойБазыАИТП"
		);
		
КонецПроцедуры

Процедура УдалитьПользователяИнформационнойБазыПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриВыполненииЗадачи(ТочкаМаршрутаБизнесПроцесса
		, Задача
		);
		
КонецПроцедуры

Процедура РезультатУдаленияПользователяОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
	Результат = БизнесПроцессыАИТП.ВыборВариантаРезультатПоложительныйОтрицательныйОшибка(
		ТочкаВыбораВарианта
		, ЭтотОбъект
		, БизнесПроцессы.УдалитьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.УдалитьПользователяИнформационнойБазы
		);
		
КонецПроцедуры

Процедура ОбработатьОшибкуУдаленияПользователяИБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	// Вставить содержимое обработчика.
	ЗадачаСОшибкой = БизнесПроцессыАИТП.ПолучитьИнформациюОПоследнейВыполненнойЗадаче(
		ЭтотОбъект
		, БизнесПроцессы.УдалитьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.УдалитьПользователяИнформационнойБазы).Задача;
		
	ФормируемыеЗадачи[0].ОшибкаДляОбработки = ЗадачаСОшибкой.Ошибка;
	ФормируемыеЗадачи[0].СпособВыполнения = Перечисления.СпособыВыполненияЗадачАИТП.Интерактивно;
	БизнесПроцессыАИТП.ПриСозданииЗадачи(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи[0], Перечисления.ВидыЗадачАИТП.ОбработкаОшибки);
	
КонецПроцедуры

Процедура ОбработатьОшибкуУдаленияПользователяИБПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриВыполненииЗадачи(ТочкаМаршрутаБизнесПроцесса, Задача);
	
КонецПроцедуры

Процедура ДальнейшиеДействияОбработатьОшибкуУдаленияПользователяИБОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
	Результат = БизнесПроцессыАИТП.ВыборВариантаПродолжитьПовторитьЗавершитьОтменить(ТочкаВыбораВарианта
		, ЭтотОбъект
		, БизнесПроцессы.УдалитьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.ОбработатьОшибкуУдаленияПользователяИБ
		);
		
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриЗавершенииБП(
		ТочкаМаршрутаБизнесПроцесса
		, ЭтотОбъект
		, Перечисления.РезультатыВыполненияДействияАИТП.Положительный
		, Перечисления.ДальнейшиеДействияАИТП.Продолжить
		);
	
КонецПроцедуры

Процедура ЗавершениеОтменитьПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриЗавершенииБП(
		ТочкаМаршрутаБизнесПроцесса
		, ЭтотОбъект
		, Перечисления.РезультатыВыполненияДействияАИТП.Отрицательный
		, Перечисления.ДальнейшиеДействияАИТП.Отменить
		);

КонецПроцедуры

Процедура ЗавершениеЗавершитьПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриЗавершенииБП(
		ТочкаМаршрутаБизнесПроцесса
		, ЭтотОбъект
		, Перечисления.РезультатыВыполненияДействияАИТП.Отрицательный
		, Перечисления.ДальнейшиеДействияАИТП.Завершить
		);

КонецПроцедуры
